<p style="text-align:center">
    <a href="https://skills.network/?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDS0321ENSkillsNetwork865-2022-01-01" target="_blank">
    <img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/assets/logos/SN_web_lightmode.png" width="200" alt="Skills Network Logo"  />
    </a>
</p>

<h1 align=center><font size = 5>Assignment: SQL Notebook for Peer Assignment</font></h1>

Estimated time needed: **60** minutes.

## Introduction
Using this Python notebook you will:

1.  Understand the Spacex DataSet
2.  Load the dataset  into the corresponding table in a Db2 database
3.  Execute SQL queries to answer assignment questions

## Overview of the DataSet

SpaceX has gained worldwide attention for a series of historic milestones. 

It is the only private company ever to return a spacecraft from low-earth orbit, which it first accomplished in December 2010.
SpaceX advertises Falcon 9 rocket launches on its website with a cost of 62 million dollars wheras other providers cost upward of 165 million dollars each, much of the savings is because Space X can reuse the first stage. 


Therefore if we can determine if the first stage will land, we can determine the cost of a launch. 

This information can be used if an alternate company wants to bid against SpaceX for a rocket launch.

This dataset includes a record for each payload carried during a SpaceX mission into outer space.

### Download the datasets

This assignment requires you to load the spacex dataset.

In many cases the dataset to be analyzed is available as a .CSV (comma separated values) file, perhaps on the internet. Click on the link below to download and save the dataset (.CSV file):

 <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv" target="_blank">Spacex DataSet</a>

### Connect to the database

Let us first load the SQL extension and establish a connection with the database

In [22]:
%reload_ext sql

In [8]:
import csv, sqlite3

con = sqlite3.connect("spacex_sql.db")
cur = con.cursor()

In [11]:
conn = sqlite3.connect('spacex_sql.db')
cursor = conn.cursor()

In [61]:
import pandas as pd
df = pd.read_csv("Spacex.csv")
df.to_sql("SPACEXTBL", con, if_exists='replace', index=False,method="multi")

/Users/jonathankinsey/opt/anaconda3/lib/python3.9/site-packages/pandas/core/generic.py:2605: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  sql.to_sql(

## Tasks

Now write and execute SQL queries to solve the assignment tasks.

**Note: If the column names are in mixed case enclose it in double quotes
   For Example "Landing_Outcome"**

### Task 1




##### Display the names of the unique launch sites  in the space mission

In [62]:
cursor.execute('SELECT Launch_Site FROM SPACEXTBL GROUP BY Launch_Site;')
results=cursor.fetchall()
results_df = pd.DataFrame(results)
results_df

              0
0   CCAFS LC-40
1  CCAFS SLC-40
2    KSC LC-39A
3   VAFB SLC-4E


### Task 2


#####  Display 5 records where launch sites begin with the string 'CCA'

In [63]:
cursor.execute('SELECT * FROM SPACEXTBL WHERE Launch_Site LIKE "%CCA%" LIMIT 5;')
results = cursor.fetchall()
results_df = pd.DataFrame(results)
results_df

,0,1,2,3,4,5,6,7,8,9
0,04-06-2010,18:45:00,F9 v1.0 B0003,CCAFS LC-40,Dragon Spacecraft Qualification Unit,0,LEO,SpaceX,Success,Failure (parachute)
1,08-12-2010,15:43:00,F9 v1.0 B0004,CCAFS LC-40,"Dragon demo flight C1, two CubeSats, barrel of...",0,LEO (ISS),NASA (COTS) NRO,Success,Failure (parachute)
2,22-05-2012,07:44:00,F9 v1.0 B0005,CCAFS LC-40,Dragon demo flight C2,525,LEO (ISS),NASA (COTS),Success,No attempt
3,08-10-2012,00:35:00,F9 v1.0 B0006,CCAFS LC-40,SpaceX CRS-1,500,LEO (ISS),NASA (CRS),Success,No attempt
4,01-03-2013,15:10:00,F9 v1.0 B0007,CCAFS LC-40,SpaceX CRS-2,677,LEO (ISS),NASA (CRS),Success,No attempt

### Task 3




##### Display the total payload mass carried by boosters launched by NASA (CRS)

In [64]:
cursor.execute('SELECT SUM(PAYLOAD_MASS__KG_) FROM SPACEXTBL WHERE Customer LIKE "%NASA (CRS)%";')
results = cursor.fetchall()
results_df = pd.DataFrame(results)
results_df

       0
0  48213

### Task 4




##### Display average payload mass carried by booster version F9 v1.1

In [65]:
cursor.execute('SELECT AVG(PAYLOAD_MASS__KG_) FROM SPACEXTBL WHERE Booster_Version LIKE "%F9 v1.1%";')
results = cursor.fetchall()
results_df = pd.DataFrame(results)
results_df

             0
0  2534.666667

### Task 5

##### List the date when the first succesful landing outcome in ground pad was acheived.


_Hint:Use min function_

In [69]:
cursor.execute('SELECT DATE FROM SPACEXTBL WHERE LANDING_OUTCOME LIKE "%(ground pad)%" ORDER BY DATE ASC LIMIT 1;')
results = cursor.fetchall()
results_df = pd.DataFrame(results)
results_df

            0
0  01-05-2017

### Task 6

##### List the names of the boosters which have success in drone ship and have payload mass greater than 4000 but less than 6000

In [72]:
cursor.execute('SELECT BOOSTER_VERSION FROM SPACEXTBL WHERE LANDING_OUTCOME LIKE "%(drone ship)%" AND Payload_mass__kg_ > 4000 AND Payload_mass__kg_ < 6000;')
results = cursor.fetchall()
results_df = pd.DataFrame(results)
results_df

                0
0     F9 FT B1020
1     F9 FT B1022
2     F9 FT B1026
3  F9 FT  B1021.2
4  F9 FT  B1031.2

### Task 7




##### List the total number of successful and failure mission outcomes

In [74]:
cursor.execute('SELECT MISSION_OUTCOME, COUNT(MISSION_OUTCOME) FROM SPACEXTBL WHERE MISSION_OUTCOME LIKE "%Success%" OR MISSION_OUTCOME LIKE "%Failure%" GROUP BY MISSION_OUTCOME;')
results = cursor.fetchall()
results_df = pd.DataFrame(results)
results_df

                                  0   1
0               Failure (in flight)   1
1                           Success  98
2                          Success    1
3  Success (payload status unclear)   1

### Task 8



##### List the   names of the booster_versions which have carried the maximum payload mass. Use a subquery

In [75]:
cursor.execute('SELECT BOOSTER_VERSION, PAYLOAD_MASS__KG_ FROM SPACEXTBL WHERE PAYLOAD_MASS__KG_ = (SELECT MAX(PAYLOAD_MASS__KG_) FROM SPACEXTBL);')
results = cursor.fetchall()
results_df = pd.DataFrame(results)
results_df

                 0      1
0    F9 B5 B1048.4  15600
1    F9 B5 B1049.4  15600
2    F9 B5 B1051.3  15600
3    F9 B5 B1056.4  15600
4    F9 B5 B1048.5  15600
5    F9 B5 B1051.4  15600
6    F9 B5 B1049.5  15600
7   F9 B5 B1060.2   15600
8   F9 B5 B1058.3   15600
9    F9 B5 B1051.6  15600
10   F9 B5 B1060.3  15600
11  F9 B5 B1049.7   15600

### Task 9


##### List the records which will display the month names, failure landing_outcomes in drone ship ,booster versions, launch_site for the months in year 2015.

**Note: SQLLite does not support monthnames. So you need to use  substr(Date, 4, 2) as month to get the months and substr(Date,7,4)='2015' for year.**

In [76]:
cursor.execute('SELECT DATE, Landing_Outcome, booster_version, launch_site FROM SPACEXTBL WHERE LANDING_OUTCOME LIKE "%Failure (drone ship)%" AND DATE LIKE "%2015%";')
results = cursor.fetchall()
results_df = pd.DataFrame(results)
results_df

            0                     1              2            3
0  10-01-2015  Failure (drone ship)  F9 v1.1 B1012  CCAFS LC-40
1  14-04-2015  Failure (drone ship)  F9 v1.1 B1015  CCAFS LC-40

### Task 10




##### Rank the  count of  successful landing_outcomes between the date 04-06-2010 and 20-03-2017 in descending order.

In [88]:
cursor.execute('SELECT LANDING_OUTCOME, COUNT(LANDING_OUTCOME) FROM SPACEXTBL WHERE LANDING_OUTCOME LIKE "%Success%" AND DATE BETWEEN "04-06-2010" AND "20-03-2017" GROUP BY LANDING_OUTCOME ORDER BY COUNT(LANDING_OUTCOME) DESC;')
results = cursor.fetchall()
results_df = pd.DataFrame(results)
results_df

                      0   1
0               Success  20
1  Success (drone ship)   8
2  Success (ground pad)   6

In [89]:
conn.close()

### Reference Links

* <a href ="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20String%20Patterns%20-%20Sorting%20-%20Grouping/instructional-labs.md.html?origin=www.coursera.org">Hands-on Lab : String Patterns, Sorting and Grouping</a>  

*  <a  href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Built-in%20functions%20/Hands-on_Lab__Built-in_Functions.md.html?origin=www.coursera.org">Hands-on Lab: Built-in functions</a>

*  <a  href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Sub-queries%20and%20Nested%20SELECTs%20/instructional-labs.md.html?origin=www.coursera.org">Hands-on Lab : Sub-queries and Nested SELECT Statements</a>

*   <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%205/DB0201EN-Week3-1-3-SQLmagic.ipynb">Hands-on Tutorial: Accessing Databases with SQL magic</a>

*  <a href= "https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%205/DB0201EN-Week3-1-4-Analyzing.ipynb">Hands-on Lab: Analyzing a real World Data Set</a>

## Author(s)

<h4> Lakshmi Holla </h4>

## Other Contributors

<h4> Rav Ahuja </h4>

## Change log
| Date | Version | Changed by | Change Description |
|------|--------|--------|---------|
| 2021-07-09 | 0.2 |Lakshmi Holla | Changes made in magic sql|
| 2021-05-20 | 0.1 |Lakshmi Holla | Created Initial Version |

## <h3 align="center"> Â© IBM Corporation 2021. All rights reserved. <h3/>